Terraform Plan:

```
github_repository.infra_template: Refreshing state... [id=aws-infra-template-tf]
github_actions_secret.dev_assume_role: Refreshing state... [id=aws-infra-template-tf:DEV_ASSUME_ROLE]
github_actions_secret.prod_assume_role: Refreshing state... [id=aws-infra-template-tf:PROD_ASSUME_ROLE]
github_actions_secret.stage_assume_role: Refreshing state... [id=aws-infra-template-tf:STAGE_ASSUME_ROLE]
github_branch_protection.infra_template_barnch_protection: Refreshing state... [id=BPR_kwDOLBk3bM4CuH9-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.gh_token_secret will be created
  + resource "github_actions_secret" "gh_token_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-infra-template-tf"
      + secret_name     = "GH_PAT_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.infra_template_barnch_protection will be updated in-place
  ~ resource "github_branch_protection" "infra_template_barnch_protection" {
        id                              = "BPR_kwDOLBk3bM4CuH9-"
        # (12 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "/JosiahBurnham",
            ]
            # (6 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan/repos_terraform_template_repo.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan/repos_terraform_template_repo.tfplan"
stdout<<ghadelimiter_08075eae-979f-48b2-9157-d1b28693ca7c
github_repository.infra_template: Refreshing state... [id=aws-infra-template-tf]
github_actions_secret.dev_assume_role: Refreshing state... [id=aws-infra-template-tf:DEV_ASSUME_ROLE]
github_actions_secret.prod_assume_role: Refreshing state... [id=aws-infra-template-tf:PROD_ASSUME_ROLE]
github_actions_secret.stage_assume_role: Refreshing state... [id=aws-infra-template-tf:STAGE_ASSUME_ROLE]
github_branch_protection.infra_template_barnch_protection: Refreshing state... [id=BPR_kwDOLBk3bM4CuH9-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.gh_token_secret will be created
  + resource "github_actions_secret" "gh_token_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-infra-template-tf"
      + secret_name     = "GH_PAT_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.infra_template_barnch_protection will be updated in-place
  ~ resource "github_branch_protection" "infra_template_barnch_protection" {
        id                              = "BPR_kwDOLBk3bM4CuH9-"
        # (12 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "/JosiahBurnham",
            ]
            # (6 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan/repos_terraform_template_repo.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan/repos_terraform_template_repo.tfplan"

ghadelimiter_08075eae-979f-48b2-9157-d1b28693ca7c
stderr<<ghadelimiter_65ba1351-c5f5-4368-b1ca-eb7a97ccac9d

ghadelimiter_65ba1351-c5f5-4368-b1ca-eb7a97ccac9d
exitcode<<ghadelimiter_5670282c-52dd-412b-aec9-7e8df11152ec
0
ghadelimiter_5670282c-52dd-412b-aec9-7e8df11152ec
```